## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/57819960/audit-trail/9d30eda9-a916-440e-a5a2-cededb4aef05).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## Dir: layers/core | Success :thumbsup:
**Dir**: layers/core
**Workspace**: default
**Success**: :thumbsup:
**Command**: `tofu plan -detailed-exitcode -out /tmp/tmpjcc5rbaz/plan`

```diff

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # module.etcd.module.etcd_deployment.akash_deployment.service will be created
+   resource "akash_deployment" "service" {
+       deployment_dseq               = (known after apply)
+       deployment_gseq               = (known after apply)
+       deployment_oseq               = (known after apply)
+       deployment_owner              = (known after apply)
+       deployment_state              = (known after apply)
+       escrow_account_balance_amount = (known after apply)
+       escrow_account_balance_denom  = (known after apply)
+       escrow_account_owner          = (known after apply)
+       id                            = (known after apply)
+       last_updated                  = (known after apply)
+       provider_address              = (known after apply)
+       sdl                           = (sensitive value)
+       services                      = (known after apply)

+       provider_filters {
+           enforce   = true
+           providers = []
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```


</details>


---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
